socialNetwork/results/scale-on-bench1.5-sweep/benchmark1.5b-sweep-05-14-26_064705/istio/200.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 25.241ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 25.988ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 26.275ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 25.444ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 25.403ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 26.396ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 26.093ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 25.977ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 26.336ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 25.649ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 25.706ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 26.115ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 25.867ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 25.244ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 26.337ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 25.116ms, rate sampling interval: 57ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.46ms   17.91ms  45.18ms   98.75%
    Req/Sec    11.73     13.85    52.00     83.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   23.69ms
 75.000%   25.50ms
 90.000%   28.74ms
 99.000%   45.18ms
 99.900%  200.19ms
 99.990%  689.15ms
 99.999%  764.41ms
100.000%  764.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      16.575     0.000000            1         1.00
      22.015     0.100000         2136         1.11
      22.543     0.200000         4206         1.25
      22.911     0.300000         6320         1.43
      23.279     0.400000         8389         1.67
      23.695     0.500000        10515         2.00
      23.951     0.550000        11546         2.22
      24.239     0.600000        12597         2.50
      24.575     0.650000        13654         2.86
      24.959     0.700000        14670         3.33
      25.503     0.750000        15728         4.00
      25.807     0.775000        16232         4.44
      26.207     0.800000        16742         5.00
      26.671     0.825000        17267         5.71
      27.199     0.850000        17788         6.67
      27.839     0.875000        18321         8.00
      28.287     0.887500        18584         8.89
      28.735     0.900000        18839        10.00
      29.311     0.912500        19099        11.43
      29.999     0.925000        19358        13.33
      30.895     0.937500        19622        16.00
      31.599     0.943750        19753        17.78
      32.319     0.950000        19883        20.00
      33.055     0.956250        20012        22.86
      34.143     0.962500        20143        26.67
      35.551     0.968750        20279        32.00
      36.191     0.971875        20340        35.56
      37.151     0.975000        20405        40.00
      38.335     0.978125        20471        45.71
      39.999     0.981250        20535        53.33
      41.663     0.984375        20601        64.00
      42.335     0.985938        20635        71.11
      43.423     0.987500        20666        80.00
      44.415     0.989062        20699        91.43
      45.535     0.990625        20731       106.67
      46.527     0.992188        20765       128.00
      47.167     0.992969        20781       142.22
      47.839     0.993750        20797       160.00
      49.567     0.994531        20813       182.86
      52.127     0.995313        20829       213.33
      56.895     0.996094        20846       256.00
      60.479     0.996484        20855       284.44
      63.391     0.996875        20862       320.00
      70.271     0.997266        20870       365.71
      74.879     0.997656        20878       426.67
      90.111     0.998047        20887       512.00
     100.607     0.998242        20891       568.89
     124.031     0.998437        20895       640.00
     137.599     0.998633        20899       731.43
     171.135     0.998828        20903       853.33
     230.527     0.999023        20907      1024.00
     333.311     0.999121        20909      1137.78
     445.951     0.999219        20911      1280.00
     456.191     0.999316        20913      1462.86
     555.007     0.999414        20915      1706.67
     587.775     0.999512        20917      2048.00
     604.159     0.999561        20918      2275.56
     611.327     0.999609        20919      2560.00
     635.903     0.999658        20920      2925.71
     636.415     0.999707        20922      3413.33
     636.415     0.999756        20922      4096.00
     642.559     0.999780        20923      4551.11
     642.559     0.999805        20923      5120.00
     666.623     0.999829        20924      5851.43
     666.623     0.999854        20924      6826.67
     689.151     0.999878        20925      8192.00
     689.151     0.999890        20925      9102.22
     689.151     0.999902        20925     10240.00
     720.895     0.999915        20926     11702.86
     720.895     0.999927        20926     13653.33
     720.895     0.999939        20926     16384.00
     720.895     0.999945        20926     18204.44
     720.895     0.999951        20926     20480.00
     764.415     0.999957        20927     23405.71
     764.415     1.000000        20927          inf
#[Mean    =       25.461, StdDeviation   =       17.909]
#[Max     =      763.904, Total count    =        20927]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  22857 requests in 2.00m, 332.57MB read
  Socket errors: connect 0, read 0, write 0, timeout 375
Requests/sec:    190.45  
Transfer/sec:      2.77MB